aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c

/*
 * File:   main.c
 * Author: ICE_MEGANE
 *
 * Created on 2020/03/5, 22:26
 */

#include <xc.h>
#include "../userdefine.h"

#include "mcu_setup.h"

/* 関数プロトタイプ宣言 */
static void func_mset_s_option_reg_setup( void );
static void func_mset_s_watchdog_setup( void );

static void func_mset_s_oscillator_setup( void );
static void func_mset_s_pwr_save_setup( void );
static void func_mset_s_int_setup( void );
static void func_mset_s_port_setup( void );
static void func_mset_s_ioc_setup( void );
static void func_mset_s_pps_setup( void );


static void func_mset_s_adc_setup( void );
static void func_mset_s_dac_setup( void );

static void func_mset_s_ccp_pwm_setup( void );
static void func_mset_s_ccp_setup( void );
static void func_mset_s_pwm_setup( void );

static void func_mset_s_timer_setup( void );
static void func_mset_s_timer0_setup( void );
static void func_mset_s_timer1_setup( void );
static void func_mset_s_timer3_setup( void );
static void func_mset_s_timer5_setup( void );
static void func_mset_s_timer2_setup( void );
static void func_mset_s_timer4_setup( void );
static void func_mset_s_timer6_setup( void );
static void func_mset_s_cwg_setup( void );


/**************************************************************/
/*  Function:                                                 */
/*  レジスタ初期設定                                            */
/*                                                            */
/**************************************************************/
void func_mset_g_init( void )
{
    func_mset_s_option_reg_setup();     /* オプションレジスタ設定 */
    func_mset_s_watchdog_setup();       /* ウォッチドックタイマ設定*/
    func_mset_s_oscillator_setup();     /* マイコンクロック設定  */
    func_mset_s_pwr_save_setup();       /* 省電力関連の設定　　　 */
    func_mset_s_int_setup();            /* 割り込み設定         */
    func_mset_s_port_setup();           /* ポート設定           */
    func_mset_s_ioc_setup();            /* IOC機能設定          */
    func_mset_s_pps_setup();            /* ポート割り当て選択設定 */
    func_mset_s_adc_setup();            /* AD変換設定           */
    func_mset_s_dac_setup();            /* DA変換設定           */ 
    func_mset_s_timer_setup();          /* タイマ設定           */
    func_mset_s_cwg_setup();            /* CWG設定             */
}


/**************************************************************/
/*  Function:                                                 */
/*  プログラム開始直前の設定                                    */
/*                                                            */
/**************************************************************/
void func_mset_g_mcu_start_condition( void )
{
    INTCON |= 0xC0U;     /* 全体割り込み(高優先度&低優先度) 許可 */
    ADCON0 |= 0x00U;     /* AD変換器 動作許可 */

    /* タイマスタート */
    /* PIC18F25Q10はレジスタ数多いのでそこそこ設定に時間かかる */
    /* 初期化中に割り込みが入るとプログラム開始しなくなるので、 */
    /* この関数を実行するタイミングですべてのタイマ動作許可を行う */
    T0EN = SET;             /* Timer0 カウントスタート */
    /*TMR5ON = SET;*/       /* Timer5 カウントスタートしない 各処理で設定 */
    TMR1ON = SET;           /* Timer1 モータ回転数検出 開始 */
    TMR3ON = SET;           /* Timer1 1次ギヤ回転数検出 開始 */

    TMR2ON = SET;           /* クラッチ用サーボ PWMタイマ 開始 */
    TMR4ON = SET;           /* インバータ用キャリア PWMタイマ 開始 */
    DAC1OE2 = SET;          /* DAC出力 許可 */
}

/**************************************************************/
/*  Function:                                                 */
/*  プログラム初期化時の設定                                    */
/*                                                            */
/**************************************************************/
void func_mset_g_mcu_stop_condition( void )
{
    INTCON &= ~0xC0U;     /* 全体割り込み(高優先度&低優先度) 禁止 */
}


    /* テンプレ */
    /*========================================================================================*/
                            /*  +-------------------------------------------- 15 :            */
                            /*  | +------------------------------------------ 14 :            */
                            /*  | | +---------------------------------------- 13 : FCMEN      */
                            /*  | | | +-------------------------------------- 12 : TMR0SE     */
                            /*  | | | |                                                       */
                            /*  | | | |     +-------------------------------- 11 : PSA        */
                            /*  | | | |     | +------------------------------ 10 : PS<2>      */
                            /*  | | | |     | | +---------------------------- 9  : PS<1>      */
                            /*  | | | |     | | | + ------------------------- 8  : PS<0>      */
                            /*  | | | |     | | | |     +-------------------- 7  :            */
                            /*  | | | |     | | | |     | +------------------ 6  :            */
                            /*  | | | |     | | | |     | | +---------------- 5  :  FCMEN     */
                            /*  | | | |     | | | |     | | | +-------------- 4  : TMR0SE     */
                            /*  | | | |     | | | |     | | | |                               */
                            /*  | | | |     | | | |     | | | |     +-------- 3  : PSA        */
                            /*  | | | |     | | | |     | | | |     | +------ 2  : PS<2>      */
                            /*  | | | |     | | | |     | | | |     | | +---- 1  : PS<1>      */
                            /*  | | | |     | | | |     | | | |     | | | +-- 0  : PS<0>      */
                            /*  | | | |     | | | |     | | | |     | | | |                   */
                            /*  0 0 0 0  -  0 1 1 0  -  0 0 0 0  -  0 0 0 0                   */
    /*----------------------------------------------------------------------------------------*/
    /* memo                                                                                   */
    /*                                                                                        */
    /*========================================================================================*/
    
