aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : TUN5    */
                            /*  | | | +------------------- 4 : TUN4    */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TUN3    */
                            /*  | | | |     | +----------- 2 : TUN2    */
                            /*  | | | |     | | +--------- 1 : TUN1    */
                            /*  | | | |     | | | + ------ 0 : TUN0    */
                            /*  0 0 0 0  -  0 0 1 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 特に調整するつもりはないので初期設定                               */
    /*=================================================================*/

/**************************************************************/
/*  Function:                                                 */
/*  オプションレジスタ初期設定                                   */
/*  クロックより先に設定したほうがよさそう                        */
/**************************************************************/
static void func_mset_s_option_reg_setup( void )
{
    ;
}


/**************************************************************/
/*  Function:                                                 */
/*  クロック初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_oscillator_setup( void )
{
    /* 新クロック周波数設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 : NOSC<2> */   /* HFINTOSC */
                            /*  | | +--------------------- 5 : NOSC<1> */ 
                            /*  | | | +------------------- 4 : NOSC<0> */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : NDIV<3> */   /* 分周 1:1 */
                            /*  | | | |     | +----------- 2 : NDIV<2> */
                            /*  | | | |     | | +--------- 1 : NDIV<1> */
                            /*  | | | |     | | | + ------ 0 : NDIV<0> */
    OSCCON1 =  0x60U;       /*  0 1 1 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 現在のクロック周波数設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 : COSC<2> */   /* HFINTOSC */
                            /*  | | +--------------------- 5 : COSC<1> */ 
                            /*  | | | +------------------- 4 : COSC<0> */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : CDIV<3> */   /* 分周 1:1 */
                            /*  | | | |     | +----------- 2 : CDIV<2> */
                            /*  | | | |     | | +--------- 1 : CDIV<1> */
                            /*  | | | |     | | | + ------ 0 : CDIV<0> */
    OSCCON2 =  0x60U;       /*  0 1 1 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 現在のクロック周波数設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 : CSWHOLD */   /* クロック準備整ったら自動切換え */
                            /*  | +----------------------- 6 : SOSCPWR */   /*  */
                            /*  | | +--------------------- 5 :         */ 
                            /*  | | | +------------------- 4 : ORDY    */   /* RO */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : NOSCR   */   /* RO */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    OSCCON3 =  0x00U;       /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /*OSCSTAT = 0x00U;*/    /* RO */

    /* HFINTOSC 周波数設定 */
    /*==================================================================*/
                            /*  +------------------------- 7 :          */
                            /*  | +----------------------- 6 :          */
                            /*  | | +--------------------- 5 :          */ 
                            /*  | | | +------------------- 4 :          */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : HFFRQ<3> */
                            /*  | | | |     | +----------- 2 : HFFRQ<2> */
                            /*  | | | |     | | +--------- 1 : HFFRQ<1> */
                            /*  | | | |     | | | + ------ 0 : HFFRQ<0> */
    OSCFRQ =  0x08U;        /*  0 0 0 0  -  0 0 0 0                      */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /*                                                                  */
    /*==================================================================*/

