aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* 割り込み許可 */
    /*=================================================================*/
                            /*  +------------------------- 7 : HLVDIE  */   /* High/Low 電圧割り込み　無効 */
                            /*  | +----------------------- 6 : ZCDIE   */   /* ゼロクロス割り込み　無効 */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : C2IE    */   /* 内蔵コンパレータ2変化割り込み　無効 */
                            /*  | | | |     | | | + ------ 0 : C1IE    */   /* 内蔵コンパレータ1変化割り込み　無効 */
    PIE2 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 割り込み優先度 */
    /*=================================================================*/
                            /*  +------------------------- 7 : HLVDIP  */
                            /*  | +----------------------- 6 : ZCDIP   */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : C2IP    */
                            /*  | | | |     | | | + ------ 0 : C1IP    */
    IPR2 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0:Low priority                                                  */
    /* 1:High priority                                                 */
    /*=================================================================*/

    /* 割り込みフラグ */
    /*=================================================================*/
                            /*  +------------------------- 7 : HLVDIF  */
                            /*  | +----------------------- 6 : ZCDIF   */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : C2IF    */
                            /*  | | | |     | | | + ------ 0 : C1IF    */
    PIR2 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/





    /* 割り込み許可 */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : RC1IE   */   /* EUSART1 受信割り込み 無効 */
                            /*  | | | +------------------- 4 : TX1IE   */   /* EUSART1 送信割り込み 無効 */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : BCL1IE  */   /* MSSP1 バス衝突割り込み 無効 */
                            /*  | | | |     | | | + ------ 0 : SSP1IE  */   /* 同期シリアルポート1 割り込み　無効 */
    PIE3 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 割り込み優先度 */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : RC1IP   */
                            /*  | | | +------------------- 4 : TX1IP   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : BCL1IP  */
                            /*  | | | |     | | | + ------ 0 : SSP1IP  */
    IPR3 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0:Low priority                                                  */
    /* 1:High priority                                                 */
    /*=================================================================*/

    /* 割り込みフラグ */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : RC1IF   */
                            /*  | | | +------------------- 4 : TX1IF   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : BCL1IF  */
                            /*  | | | |     | | | + ------ 0 : SSP1IF  */
    PIR3 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/




