aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : DAC1R4  */   /* 0/32 -> 0V設定  */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : DAC1R3  */
                            /*  | | | |     | +----------- 2 : DAC1R2  */
                            /*  | | | |     | | +--------- 1 : DAC1R1  */
                            /*  | | | |     | | | + ------ 0 : DAC1R0  */
    DAC1CON1 = 0x00U;       /*  0 0 0 0  -  0 0 0 0                   */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
}

/**************************************************************/
/*  Function:                                                 */
/*  タイマ初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_pps_setup( void )
{ /* 改めてクソ高級マイコンだなと思う 全部のポートで割り当て変更可能・・・ */
    /* データシート補足 */
    /* xxxPPS：これは特定のレジスタを挿すわけではない */
    /* []PPSにおいて、ポート入力を選ぶ場合に、PORTA/B/Cのx番を登録したい際、どのように設定すればよいか、その設定例を示したもの。 */
    /* xxxPPSという１つのレジスタがあるわけではなく、以降の設定について説明しているだけ。 */

    /* PPS入力設定 */
    /* PORT<1:0> ---- 00：PORTA / 01：PORTB / 10：PORTC */
    /* PIN<2:0>  ---- 2進数で0～7を指定する */

    /* PPS出力設定 */
    /* データシート参照 */

    /* ピン機能選択 有効/無効 切り替えレジスタ */
    PPSLOCK = 0x00;             /* ロック解除：PPS機能選択を許可 */


    /* @@基本初期値 必要に応じて設定 */

    /* 出力割り当て設定 */
    /* PORTAの出力バッファの選択 */
    RA0PPS = 0x00U;             /* LATA0 を割り当て */
    RA1PPS = 0x00U;             /* LATA1 を割り当て */
    RA2PPS = 0x00U;             /* LATA2 を割り当て */
    RA3PPS = 0x00U;             /* LATA3 を割り当て */
    RA4PPS = 0x00U;             /* LATA4 を割り当て */
    RA5PPS = 0x00U;             /* LATA5 を割り当て */
    RA6PPS = 0x00U;             /* LATA6 を割り当て */
    RA7PPS = 0x00U;             /* LATA7 を割り当て */

    /* PORTBの出力バッファの選択 */
    RB0PPS = 0x00U;             /* LATB0 を割り当て */
    RB1PPS = 0x00U;             /* LATB1 を割り当て */
    RB2PPS = 0x00U;             /* LATB2 を割り当て */
    RB3PPS = 0x00U;             /* LATB3 を割り当て */
    RB4PPS = 0x00U;             /* LATB4 を割り当て */
    RB5PPS = 0x00U;             /* LATB5 を割り当て */
    RB6PPS = 0x00U;             /* LATB6 を割り当て */
    RB7PPS = 0x00U;             /* LATB7 を割り当て */

    /* PORTCの出力バッファの選択 */
    RC0PPS = 0x00U;             /* LATC0 を割り当て */
    RC1PPS = 0x00U;             /* LATC1 を割り当て */
    RC2PPS = 0x00U;             /* LATC2 を割り当て */
    RC3PPS = 0x07U;             /* PWM3  を割り当て */   /* 特殊機能 PWM3 はAとCに割り当て可能。今回はC3に割り当て */
    RC4PPS = 0x04U;             /* CWG1D を割り当て */   /* 特殊機能 */
    RC5PPS = 0x03U;             /* CWG1C を割り当て */   /* 特殊機能 */
    RC6PPS = 0x02U;             /* CWG1B を割り当て */   /* 特殊機能 */
    RC7PPS = 0x01U;             /* CWG1A を割り当て */   /* 特殊機能 */

    /* タイマ ゲート選択 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : -          */
                            /*  | | | +------------------- 4 : PORT<1>    */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : PORT<0>    */
                            /*  | | | |     | +----------- 2 : PIN<2>     */
                            /*  | | | |     | | +--------- 1 : PIN<1>     */
                            /*  | | | |     | | | + ------ 0 : PIN<0>     */
    T1GPPS = 0x10U;         /*  # # # 1  -  0 0 0 0                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /* タイマ1 ゲート選択：RC0                                              */
    /*====================================================================*/

    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : -          */
                            /*  | | | +------------------- 4 : PORT<1>    */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : PORT<0>    */
                            /*  | | | |     | +----------- 2 : PIN<2>     */
                            /*  | | | |     | | +--------- 1 : PIN<1>     */
                            /*  | | | |     | | | + ------ 0 : PIN<0>     */
    T3GPPS = 0x11U;         /*  # # # 1  -  0 0 0 1                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /* タイマ3 ゲート選択：RC1                                              */
    /*====================================================================*/

    /* 一応設定終わったらロックしとく */
    /* ピン機能選択 有効/無効 切り替えレジスタ */
    PPSLOCK = 0x01;             /* ロック設定：PPS機能選択を禁止 */
}





/**************************************************************/
/*  Function:                                                 */
/*  タイマ初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_timer_setup( void )
{
    func_mset_s_ccp_pwm_setup();

    func_mset_s_timer0_setup();     /* メインタスク用 タイマ0 */

    func_mset_s_timer1_setup();     /* モータ側ギヤ 回転数取得 ※ゲート機能使用中 */
    func_mset_s_timer3_setup();     /* 1次側ギヤ 回転数取得 ※ゲート機能中 */
    func_mset_s_timer5_setup();     /* ラジコンプロポのパルス幅取得用 */

    func_mset_s_timer2_setup();     /* クラッチ用サーボPWM ※PWM機能へ割り当て中 */
    func_mset_s_timer4_setup();     /* インバータ制御PWM 　※PWM機能へ割り当て中 */
    func_mset_s_timer6_setup();
}




/**************************************************************/
/*  Function:                                                 */
/*  タイマ0初期設定                                            */
/*  メインタスクの時間管理用につかう                             */
/**************************************************************/
static void func_mset_s_timer0_setup( void )
{
    /* タイマ0のクロックソースはPPS設定内で処理 */
    /* Fosc/4 で内部クロック選択した時点で、PPSは影響なし */
    
    /* 10kHzでオーバーフローするよう */

    /* タイマ初期設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : T0EN       */    /* タイマ0 動作許可 */ 
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : T0OUT      */    /* RO */
                            /*  | | | +------------------- 4 : T016BIT    */    /* 8bit タイマモード */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : T0OUTPS<3> */    /* 割り込みポストスケーラ */
                            /*  | | | |     | +----------- 2 : T0OUTPS<2> */
                            /*  | | | |     | | +--------- 1 : T0OUTPS<1> */
                            /*  | | | |     | | | + ------ 0 : T0OUTPS<0> */
    T0CON0 = 0x00U;         /*  1 0 0 0  -  0 0 0 0                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /*====================================================================*/
                            /*  +------------------------- 7 : T0CS<2>    */    /* 010：Fosc/4 を選択 -> 64/4=16MHz */
                            /*  | +----------------------- 6 : T0CS<1>    */
                            /*  | | +--------------------- 5 : T0CS<0>    */
                            /*  | | | +------------------- 4 : T0ASYNC    */    /* 0:同期を選択 */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : T0CKPS<3>  */    /* 0111:プリスケーラ：1:512 */
                            /*  | | | |     | +----------- 2 : T0CKPS<2>  */
                            /*  | | | |     | | +--------- 1 : T0CKPS<1>  */
                            /*  | | | |     | | | + ------ 0 : T0CKPS<0>  */
    T0CON1 = 0x49U;         /*  0 1 0 0  -  1 0 0 1                        */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /* タイマ0 周期設定 ※8bitタイマモードのため、PRレジスタに相当 比較値を設定する */
    /*===================================================================*/
                            /*  +------------------------- 7 : TMR0H<7>  */
                            /*  | +----------------------- 6 : TMR0H<6>  */
                            /*  | | +--------------------- 5 : TMR0H<5>  */
                            /*  | | | +------------------- 4 : TMR0H<4>  */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : TMR0H<3>  */
                            /*  | | | |     | +----------- 2 : TMR0H<2>  */
                            /*  | | | |     | | +--------- 1 : TMR0H<1>  */
                            /*  | | | |     | | | + ------ 0 : TMR0H<0>  */
    TMR0H = 0x1FU;          /*  0 0 0 1  -  1 0 0 1                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /* タイマ0 カウンタレジスタ ※8bitタイマモード */
    /*===================================================================*/
                            /*  +------------------------- 7 : TMR0L<7>  */
                            /*  | +----------------------- 6 : TMR0L<6>  */
                            /*  | | +--------------------- 5 : TMR0L<5>  */
                            /*  | | | +------------------- 4 : TMR0L<4>  */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : TMR0L<3>  */
                            /*  | | | |     | +----------- 2 : TMR0L<2>  */
                            /*  | | | |     | | +--------- 1 : TMR0L<1>  */
                            /*  | | | |     | | | + ------ 0 : TMR0L<0>  */
    TMR0L = 0x00U;          /*  0 0 0 0  -  0 0 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  タイマ1初期設定                                            */
/*  モータ回転数の取得                                          */
/**************************************************************/
static void func_mset_s_timer1_setup( void )
{
     /* タイマクロック設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : CKPS<1>    */    /* クロック分周 1:1 */
                            /*  | | | +------------------- 4 : CKPS<0>    */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : -          */
                            /*  | | | |     | +----------- 2 : nSYNC      */    /* 外部クロック同期 (使わないのでどっちでもOK) */
                            /*  | | | |     | | +--------- 1 : RD16       */    /* 16bitモード */
                            /*  | | | |     | | | + ------ 0 : ON         */    /* タイマ停止状態 ※初期化完了後、メインタスク開始時にON */
    T1CON = 0x06U;          /*  # # 0 0  -  # 1 1 0                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /* タイマ ゲート機能設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : GE         */    /* ゲート機能 有効 */
                            /*  | +----------------------- 6 : GPOL       */    /* ゲート極性 正 */
                            /*  | | +--------------------- 5 : GTM        */    /* ゲートトグルモード １周期測定を実施する */
                            /*  | | | +------------------- 4 : GSPM       */    /* シングルパルスモード無効 連続測定する */ 
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : GGO/DONE   */    /* よみだしでしか使わないはず？ */
                            /*  | | | |     | +----------- 2 : GVAL       */    /* ゲート状態 オフだと0になる */
                            /*  | | | |     | | +--------- 1 : -          */
                            /*  | | | |     | | | + ------ 0 : -          */
    T1GCON = 0xE0U;         /*  1 1 1 0  -  0 0 # #                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /* タイマ クロック選択 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : -          */
                            /*  | | | +------------------- 4 : -          */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : CS<3>      */    /* 0101：MFINTOSC = 500kHz */
                            /*  | | | |     | +----------- 2 : CS<2>      */
                            /*  | | | |     | | +--------- 1 : CS<1>      */
                            /*  | | | |     | | | + ------ 0 : CS<0>      */
    TMR1CLK = 0x05U;        /*  # # # #  -  0 1 0 1                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/
    
    /* タイマゲート入力信号の選択 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : -          */
                            /*  | | | +------------------- 4 : -          */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : GSS<3>     */    /* 0000：T1GPPSの設定に依存 PPS設定を参照 */
                            /*  | | | |     | +----------- 2 : GSS<2>     */
                            /*  | | | |     | | +--------- 1 : GSS<1>     */
                            /*  | | | |     | | | + ------ 0 : GSS<0>     */
    TMR1GATE = 0x00U;       /*  # # # #  -  0 0 0 0                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

