aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* タイマ カウンタ現在地 クリアする */
    /* タイマ カウンタレジスタ 上位8bit */
    /*===================================================================*/
                            /*  +------------------------- 7 : TMR5H<7>  */
                            /*  | +----------------------- 6 : TMR5H<6>  */
                            /*  | | +--------------------- 5 : TMR5H<5>  */
                            /*  | | | +------------------- 4 : TMR5H<4>  */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : TMR5H<3>  */
                            /*  | | | |     | +----------- 2 : TMR5H<2>  */
                            /*  | | | |     | | +--------- 1 : TMR5H<1>  */
                            /*  | | | |     | | | + ------ 0 : TMR5H<0>  */
    TMR3H = 0x00U;          /*  0 0 0 0  -  0 0 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /* タイマ カウンタレジスタ 下位8bit */
    /*===================================================================*/
                            /*  +------------------------- 7 : TMR5L<7>  */
                            /*  | +----------------------- 6 : TMR5L<6>  */
                            /*  | | +--------------------- 5 : TMR5L<5>  */
                            /*  | | | +------------------- 4 : TMR5L<4>  */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : TMR5L<3>  */
                            /*  | | | |     | +----------- 2 : TMR5L<2>  */
                            /*  | | | |     | | +--------- 1 : TMR5L<1>  */
                            /*  | | | |     | | | + ------ 0 : TMR5L<0>  */
    TMR3L = 0x00U;          /*  0 0 0 0  -  0 0 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  タイマ5初期設定                                            */
/*  ラジコンプロポからのパルス幅測定につかう                     */
/*  チャネル数が足りないため、マイコンハードウェア機能は使わず     */
/*  フリーラン動作しているタイマのカウンタを任意で読みだしてキャプチャする */
/*  ラジコンのプロポのPWM波形はON区間が0.5ms~2.5ms程度なので、これを測定できるようにクロック調整 */
/**************************************************************/
static void func_mset_s_timer5_setup( void )
{
    /* タイマクロック設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : CKPS<1>    */    /* クロック分周 1:8 -> 2MHz */
                            /*  | | | +------------------- 4 : CKPS<0>    */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : -          */
                            /*  | | | |     | +----------- 2 : nSYNC      */    /* 外部クロック同期 (使わないのでどっちでもOK) */
                            /*  | | | |     | | +--------- 1 : RD16       */    /* 16bitモード */
                            /*  | | | |     | | | + ------ 0 : ON         */    /* タイマ停止状態 (パルス幅取得処理側でONする) */
    T5CON = 0x36U;          /*  # # 1 1  -  # 1 1 0                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /* タイマ ゲート機能設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : GE         */    /* タイマゲート機能使わない：フリーランタイマ */
                            /*  | +----------------------- 6 : GPOL       */
                            /*  | | +--------------------- 5 : GTM        */
                            /*  | | | +------------------- 4 : GSPM       */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : GGO/DONE   */
                            /*  | | | |     | +----------- 2 : GVAL       */
                            /*  | | | |     | | +--------- 1 : -          */
                            /*  | | | |     | | | + ------ 0 : -          */
    T5GCON = 0x00U;         /*  0 0 0 0  -  0 0 # #                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /* タイマ クロック選択 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : -          */
                            /*  | | | +------------------- 4 : -          */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : CS<3>      */    /* 0001：HFINTOSC/4 = 16MHz */
                            /*  | | | |     | +----------- 2 : CS<2>      */
                            /*  | | | |     | | +--------- 1 : CS<1>      */
                            /*  | | | |     | | | + ------ 0 : CS<0>      */
    TMR5CLK = 0x01U;        /*  # # # #  -  0 0 0 1                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/
    
    /* タイマゲート入力信号の選択 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : -          */
                            /*  | | | +------------------- 4 : -          */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : CS<3>      */    /* 0000：T5GPPSの設定に依存　※タイマゲート機能使わないのでなんでもOK */
                            /*  | | | |     | +----------- 2 : CS<2>      */
                            /*  | | | |     | | +--------- 1 : CS<1>      */
                            /*  | | | |     | | | + ------ 0 : CS<0>      */
    TMR5GATE = 0x03U;       /*  # # # #  -  0 0 1 1                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /* タイマ5 カウンタレジスタ 上位8bit */
    /*===================================================================*/
                            /*  +------------------------- 7 : TMR5H<7>  */
                            /*  | +----------------------- 6 : TMR5H<6>  */
                            /*  | | +--------------------- 5 : TMR5H<5>  */
                            /*  | | | +------------------- 4 : TMR5H<4>  */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : TMR5H<3>  */
                            /*  | | | |     | +----------- 2 : TMR5H<2>  */
                            /*  | | | |     | | +--------- 1 : TMR5H<1>  */
                            /*  | | | |     | | | + ------ 0 : TMR5H<0>  */
    TMR5H = 0x00U;          /*  0 0 0 0  -  0 0 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /* タイマ5 カウンタレジスタ 下位8bit */
    /*===================================================================*/
                            /*  +------------------------- 7 : TMR5L<7>  */
                            /*  | +----------------------- 6 : TMR5L<6>  */
                            /*  | | +--------------------- 5 : TMR5L<5>  */
                            /*  | | | +------------------- 4 : TMR5L<4>  */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : TMR5L<3>  */
                            /*  | | | |     | +----------- 2 : TMR5L<2>  */
                            /*  | | | |     | | +--------- 1 : TMR5L<1>  */
                            /*  | | | |     | | | + ------ 0 : TMR5L<0>  */
    TMR5L = 0x00U;          /*  0 0 0 0  -  0 0 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/
}

/**************************************************************/
/*  Function:                                                 */
/*  CCPモジュール設定                                           */
/*  Capture/Compare/PWM 機能設定につかう                        */
/**************************************************************/
static void func_mset_s_ccp_pwm_setup( void )
{
    /* CCP/PWMモジュールへのタイマ割り当て設定 */
    /*===================================================================*/
                            /*  +------------------------- 7 : P4TSEL<1> */  /* PWM4:Timer4 */
                            /*  | +----------------------- 6 : P4TSEL<0> */
                            /*  | | +--------------------- 5 : P3TSEL<1> */  /* PWM3:Timer2 */
                            /*  | | | +------------------- 4 : P3TSEL<0> */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : C2TSEL<1> */  /* CCP2:- */
                            /*  | | | |     | +----------- 2 : C2TSEL<0> */
                            /*  | | | |     | | +--------- 1 : C1TSEL<1> */  /* CCP1:- */
                            /*  | | | |     | | | + ------ 0 : C1TSEL<0> */
    CCPTMRS = 0x90U;        /*  1 0 0 1  -  0 0 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /* 01:Timer2                                                         */
    /* 10:Timer4                                                         */
    /* 11:Timer6                                                         */
    /* 00:未割当                                                          */
    /*===================================================================*/

    func_mset_s_ccp_setup();                /* CCP機能設定 CCP1,CCP2 ※PIC18F25Q10ではCCPが2chある。PWMに設定して4chすべてPWMにすることも可能。 */
    func_mset_s_pwm_setup();                /* PWM機能設定 PWM3,PWM4 ※PIC18F25Q10ではPWM設定が若干独立しているが、ここで合わせて設定する。 */
}


/**************************************************************/
/*  Function:                                                 */
/*  PWMモジュール設定                                           */
/*  CCPとは独立。PWM専用で2ch存在する。                         */
/**************************************************************/
static void func_mset_s_pwm_setup( void )
{
    /* ！！！！注意！！！！ */
    /* Duty cycle は、キャリアに対して2bit分だけ分解能を高く制御できる。ただし、これはタイマのクロックソースにFoscを使用した時だけ！！！ */
    /* ->システムクロックの内部の2bit加算処理を、分解能として使えるため。 */
    /* Foscを使わない場合は、データシートとかにある4が消え、*/
    /* キャリア周期 = タイマクロック周期 * ( T2PR + 1 ) * プリスケール値 */
    /* PWM ON-duty = PWMxDCH-PWMxDCL<7:6> * タイマクロック周期 */
    /* となる。 */

    /* ちょっと違うかも？？？プリスケーラを1:1にすると、最下位2bit連結が解除されて、上記の式に変化するっぽい？？？？ */

    /* PWM3 設定：クラッチサーボ制御用-------------------------------------------------------- */
    /*=================================================================*/
                            /*  +------------------------- 7 : EN      */   /* PWM3モジュール：有効 */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : OUT     */   /* PWM出力レベル ※Read Only */
                            /*  | | | +------------------- 4 : POL     */   /* PWM極性：normal */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : -       */
                            /*  | | | |     | | | + ------ 0 : -       */
    PWM3CON = 0x80U;        /*  1 # 0 0  -  # # # #                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* dutyは全部で10bit指定。                                          */
    /* 下位2bitはCCPxCONのDCxBビットに隠れてるので注意                    */
    /*=================================================================*/

    /* PWM duty比レジスタ 上位8bit */
    /*=================================================================*/
                            /*  +------------------------- 7 : DCH<7>  */
                            /*  | +----------------------- 6 : DCH<6>  */
                            /*  | | +--------------------- 5 : DCH<5>  */
                            /*  | | | +------------------- 4 : DCH<4>  */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : DCH<3>  */
                            /*  | | | |     | +----------- 2 : DCH<2>  */
                            /*  | | | |     | | +--------- 1 : DCH<1>  */
                            /*  | | | |     | | | + ------ 0 : DCH<0>  */
    PWM3DCH = 0x00U;        /*  1 # 0 0  -  # # # #                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* dutyは全部で10bit指定。                                          */
    /*=================================================================*/

