aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* PWM duty比レジスタ 下位(だけど上位...)2bit */
    /*=================================================================*/
                            /*  +------------------------- 7 : DCH<1>  */
                            /*  | +----------------------- 6 : DCH<0>  */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    PWM3DCL = 0x00U;        /*  0 0 # #  -  # # # #                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* dutyは全部で10bit指定。                                          */
    /*=================================================================*/

    /* PWM4 設定：インバータ制御-------------------------------------------------------- */
    /*=================================================================*/
                            /*  +------------------------- 7 : EN      */   /* PWM4モジュール：有効 */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : OUT     */   /* PWM出力レベル ※Read Only */
                            /*  | | | +------------------- 4 : POL     */   /* PWM極性：normal */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : -       */
                            /*  | | | |     | | | + ------ 0 : -       */
    PWM4CON = 0x80U;        /*  1 # 0 0  -  # # # #                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* dutyは全部で10bit指定。                                          */
    /* 下位2bitはCCPxCONのDCxBビットに隠れてるので注意                    */
    /*=================================================================*/

    /* PWM duty比レジスタ 上位8bit */
    /*=================================================================*/
                            /*  +------------------------- 7 : DCH<7>  */
                            /*  | +----------------------- 6 : DCH<6>  */
                            /*  | | +--------------------- 5 : DCH<5>  */
                            /*  | | | +------------------- 4 : DCH<4>  */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : DCH<3>  */
                            /*  | | | |     | +----------- 2 : DCH<2>  */
                            /*  | | | |     | | +--------- 1 : DCH<1>  */
                            /*  | | | |     | | | + ------ 0 : DCH<0>  */
    PWM4DCH = 0x00U;        /*  1 # 0 0  -  # # # #                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* dutyは全部で10bit指定。                                          */
    /*=================================================================*/

    /* PWM duty比レジスタ 下位(だけど上位...)2bit */
    /*=================================================================*/
                            /*  +------------------------- 7 : DCH<1>  */
                            /*  | +----------------------- 6 : DCH<0>  */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    PWM4DCL = 0x00U;        /*  0 0 # #  -  # # # #                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* dutyは全部で10bit指定。                                          */
    /*=================================================================*/
}

/**************************************************************/
/*  Function:                                                 */
/*  PWMモジュール設定                                           */
/*  CCP2ch PWMにも設定可能。                                   */
/**************************************************************/
static void func_mset_s_ccp_setup( void )
{
    ;
}

/**************************************************************/
/*  Function:                                                 */
/*  タイマ2初期設定                                            */
/*  クラッチ用サーボモータのPMMタイマとして使う                   */
/**************************************************************/
static void func_mset_s_timer2_setup( void )
{
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /* サーボモータ制御の要求仕様まとめ                                      */
    /* パルスのON幅しか見てないので、適当に分解能高くなるようにしてみた         */
    /* ONパルスが最大2.5ms、最小1.0ms程度なので、周期を4ms程度に設定した       */
    /* どのみち180分割で制御するので、あまりこだわらなくてヨシとした・・・      */
    /* クロック: MFINTOSC = 31,000Hz                                       */
    /* プリスケーラ：1/1 -> 31,000Hz = 3.226e-5                             */
    /* 一致カウント数(キャリア周期カウントPRx)設定：255 -> 255*3.226e-5 ~= 8.226...ms */  /* この設定が一番分解能高く保てる限界点 */
    /* サーボ用に2.5ms出す場合：cnt = 78  ※切り上げ                         */
    /* サーボ用に0.5ms出す場合：cnt = 15  ※切り捨て                         */
    /* ただし、duty比は10bitの分解能を持っているため、下位2bit拡張する        */
    /* ->78*4=312,  ->15*4=60  */
    /*--------------------------------------------------------------------*/

    /* ↓↓↓ほんとはこっちにしたかったが、分周256がなかった */
    /* クロック:64MHz                                                      */
    /* ペリフェラルクロック：Fosc/4 = 16MHz                                  */
    /* プリスケーラ：1/256 -> 62,500Hz                                      */
    /* 一致カウント数(キャリア周期カウントPRx)設定：255 -> 12,500/(255+1) = 244.14...Hz -> 4.096...ms */
    /*--------------------------------------------------------------------*/
    
    /* カウンタレジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    T2TMR = 0x01U;          /*  0 0 0 0  -  0 0 0 0                    */   /* 一応リロード発生しない側にセットしておく */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
    

