aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* PWM周期レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    T2PR = 0xFFU;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
    
    /* タイマ設定レジスタ */
    /*====================================================================*/
                            /*  +------------------------- 7 : ON         */
                            /*  | +----------------------- 6 : CKPS<2>    */    /* プリスケーラ 000：1:1 */
                            /*  | | +--------------------- 5 : CKPS<1>    */
                            /*  | | | +------------------- 4 : CKPS<0>    */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : OUTTPS<3>  */    /* ポストスケーラ 0000：1:1 ※PWMで使うので影響なし */
                            /*  | | | |     | +----------- 2 : OUTTPS<2>  */
                            /*  | | | |     | | +--------- 1 : OUTTPS<1>  */
                            /*  | | | |     | | | + ------ 0 : OUTTPS<0>  */
    T2CON = 0x00U;          /*  0 0 0 0  -  0 0 0 0                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*====================================================================*/

    /* タイマ ハードウェアリミッタ設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 : PSYNC   */   /* プリスケーラはFosc/4と同期 */
                            /*  | +----------------------- 6 : CPOL    */   /* Rising edgeでカウント */
                            /*  | | +--------------------- 5 : CSYNC   */   /* タイマON時にクロック同期で動作開始 */
                            /*  | | | +------------------- 4 : MODE<4> */   /* フリーランニング：ONビットでカウント/カウント停止を切り替え */
                            /*  | | | |                                */   /* @@問題ないはずだが、modeはレガシーPICとだいぶ異なるので再確認したい */
                            /*  | | | |     +------------- 3 : MODE<3> */
                            /*  | | | |     | +----------- 2 : MODE<2> */
                            /*  | | | |     | | +--------- 1 : MODE<1> */
                            /*  | | | |     | | | + ------ 0 : MODE<0> */
    T2HLT = 0xA0U;          /*  1 0 1 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* タイマ クロック選択 */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : CS<3>   */   /* 0101：MFINTOSC = 31kHz */
                            /*  | | | |     | +----------- 2 : CS<2>   */
                            /*  | | | |     | | +--------- 1 : CS<1>   */
                            /*  | | | |     | | | + ------ 0 : CS<0>   */
    T2CLKCON = 0x05U;       /*  0 0 0 0  -  0 1 0 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* タイマ外部リセット設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : RSEL<3> */   /* 予約 ※ひとまず外部リセット要因なしに設定 */
                            /*  | | | |     | +----------- 2 : RSEL<2> */
                            /*  | | | |     | | +--------- 1 : RSEL<1> */
                            /*  | | | |     | | | + ------ 0 : RSEL<0> */
    T2RST= 0x00U;           /*  0 0 0 0  -  1 1 1 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  タイマ4初期設定                                            */
/*  インバータ制御のPWM生成のために使う                          */
/**************************************************************/
static void func_mset_s_timer4_setup( void )
{
    /* カウンタレジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    T4TMR = 0x01U;          /*  0 0 0 0  -  0 0 0 0                    */   /* 一応リロード発生しない側にセットしておく */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
    

