aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* PWM周期レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    T4PR = 0xFFU;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 最大カウントをキャリア周期として利用                               */
    /*=================================================================*/
    
    /* タイマ設定レジスタ */
    /*====================================================================*/
                            /*  +------------------------- 7 : ON         */
                            /*  | +----------------------- 6 : CKPS<2>    */    /* プリスケーラ 101：1:32 */
                            /*  | | +--------------------- 5 : CKPS<1>    */
                            /*  | | | +------------------- 4 : CKPS<0>    */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : OUTTPS<3>  */    /* ポストスケーラ 0000：1:1 ※PWMで使うので影響なし */
                            /*  | | | |     | +----------- 2 : OUTTPS<2>  */
                            /*  | | | |     | | +--------- 1 : OUTTPS<1>  */
                            /*  | | | |     | | | + ------ 0 : OUTTPS<0>  */
    T4CON = 0x50U;          /*  0 1 0 1  -  0 0 0 0                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*====================================================================*/

    /* タイマ ハードウェアリミッタ設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 : PSYNC   */   /* プリスケーラはFosc/4と同期 */
                            /*  | +----------------------- 6 : CPOL    */   /* Rising edgeでカウント */
                            /*  | | +--------------------- 5 : CSYNC   */   /* タイマON時にクロック同期で動作開始 */
                            /*  | | | +------------------- 4 : MODE<4> */   /* フリーランニング：ONビットでカウント/カウント停止を切り替え */
                            /*  | | | |                                */   /* @@問題ないはずだが、modeはレガシーPICとだいぶ異なるので再確認したい */
                            /*  | | | |     +------------- 3 : MODE<3> */
                            /*  | | | |     | +----------- 2 : MODE<2> */
                            /*  | | | |     | | +--------- 1 : MODE<1> */
                            /*  | | | |     | | | + ------ 0 : MODE<0> */
    T4HLT = 0xA0U;          /*  1 0 1 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* タイマ クロック選択 */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : CS<3>   */   /* 0001：Fosc / 4 = 16MHz */
                            /*  | | | |     | +----------- 2 : CS<2>   */
                            /*  | | | |     | | +--------- 1 : CS<1>   */
                            /*  | | | |     | | | + ------ 0 : CS<0>   */
    T4CLKCON = 0x01U;       /*  0 0 0 0  -  0 0 0 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* タイマ外部リセット設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : RSEL<3> */   /* 予約 ※ひとまず外部リセット要因なしに設定 */
                            /*  | | | |     | +----------- 2 : RSEL<2> */
                            /*  | | | |     | | +--------- 1 : RSEL<1> */
                            /*  | | | |     | | | + ------ 0 : RSEL<0> */
    T4RST= 0x00U;           /*  0 0 0 0  -  1 1 1 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  タイマ0初期設定                                            */
/*  メインタスクの時間管理用につかう                             */
/**************************************************************/
static void func_mset_s_timer6_setup( void )
{
    /* 対応するCCPモジュール:CCP3 */
    /* タイマ6の設定 */
    /* ※一致割り込みを使用するだけなら、CCPの設定はいらない */
    /* タイマレジスタ初期化 */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    TMR6 = 0xFFU;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
    

    /* タイマ4初期設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : TxOUTPS<3> */
                            /*  | | +--------------------- 5 : TxOUTPS<2> */
                            /*  | | | +------------------- 4 : TxOUTPS<1> */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : TxOUTPS<0> */
                            /*  | | | |     | +----------- 2 : TMRxON     */    /* タイマ2動作 許可 */
                            /*  | | | |     | | +--------- 1 : TxCKPS<1>  */    /* タイマ2 プリスケーラ：11 -> 1/64 */
                            /*  | | | |     | | | + ------ 0 : TxCKPS<0>  */
    T6CON = 0x07U;          /*  0 0 0 0  -  0 1 1 1                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /* クロック:16MHz                                                      */
    /* ペリフェラルクロック：Fosc/4 = 4MHz                                  */
    /* プリスケーラ：1/64 -> 62,500Hz                                      */
    /* 一致カウント数(キャリア周期カウントPRx)設定：255 -> 12,500/(255+1) = 244.14...Hz -> 4.096...ms */
    /*====================================================================*/


    /* タイマ4 一致割り込み発生数値 */
    /* PWMのキャリア周期になる */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    PR6 = 0xFFU;            /*  1 1 1 1  -  1 1 1 1                    */   /* 最大カウントで一致割り込み発生させる */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*=================================================================*/
}

/**************************************************************/
/*  Function:                                                 */
/*  CWG設定                                                    */
/*                                                            */
/**************************************************************/
static void func_mset_s_cwg_setup( void )
{
    /*=================================================================*/
                            /*  +------------------------- 7 : EN      */   /* CWGモジュール：有効化 */
                            /*  | +----------------------- 6 : LD      */   /* @@要確認 */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 : MODE<2> */   /* Forward Full-Bridge Mode */
                            /*  | | | |     | | +--------- 1 : MODE<1> */
                            /*  | | | |     | | | + ------ 0 : MODE<0> */
    CWG1CON0 = 0x82U;       /*  1 0 # #  -  # 0 1 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*=================================================================*/
    
