aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 : IN      */   /* CWG input Value (RO) */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : POLD    */   /* CWG-D 出力極性：通常 */
                            /*  | | | |     | +----------- 2 : POLC    */   /* CWG-C 出力極性：通常 */
                            /*  | | | |     | | +--------- 1 : POLB    */   /* CWG-B 出力極性：通常 */
                            /*  | | | |     | | | + ------ 0 : POLA    */   /* CWG-A 出力極性：通常 */
    CWG1CON1 = 0x00U;       /*  # # # #  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*=================================================================*/
    
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 : CS      */
    CWG1CLK = 0x00U;        /*  # # # #  -  # # # 0                    */   /* Fosc */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*=================================================================*/
    
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 : ISM<2>  */   /* CWGデータ入力：100:PWM4出力 */
                            /*  | | | |     | | +--------- 1 : ISM<1>  */
                            /*  | | | |     | | | + ------ 0 : ISM<0>  */
    CWG1ISM = 0x04U;        /*  # # # #  -  # 1 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*=================================================================*/
    
    /*=================================================================*/
                            /*  +------------------------- 7 : OVRD    */
                            /*  | +----------------------- 6 : OVRC    */
                            /*  | | +--------------------- 5 : OVRB    */
                            /*  | | | +------------------- 4 : OVRA    */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : STRD    */   /* 1：CWGAはCWGデータ入力に従った出力を行う */
                            /*  | | | |     | +----------- 2 : STRC    */   /* 1：CWGBはCWGデータ入力に従った出力を行う */
                            /*  | | | |     | | +--------- 1 : STRB    */   /* 1：CWGCはCWGデータ入力に従った出力を行う */
                            /*  | | | |     | | | + ------ 0 : STRA    */   /* 1：CWGDはCWGデータ入力に従った出力を行う */
    CWG1STR = 0x04U;        /*  0 0 0 0  -  1 1 1 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* steering mode でなければ、特に設定は影響しない                     */
    /*=================================================================*/
    
    /*==================================================================*/
                            /*  +------------------------- 7 : SHUTDONW */  /* EN=0にしてCWGユニットを無効化したときに1セットされる 特に使用予定なし。 */
                            /*  | +----------------------- 6 : REN      */  /* Auto-restart 許可 */
                            /*  | | +--------------------- 5 : LSBD<1>  */  /* シャットダウンイベント発生時、デッドタイム分のインターバル待機後、POLでの極性と逆(inactive)に遷移させる */
                            /*  | | | +------------------- 4 : LSBD<0>  */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : LSAC<1>  */
                            /*  | | | |     | +----------- 2 : LSAC<0>  */
                            /*  | | | |     | | +--------- 1 : -        */
                            /*  | | | |     | | | + ------ 0 : -        */
    CWG1AS0 = 0x40U;        /*  0 1 0 0  -  0 0 # #                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* CWGの次のクロック入力までは、CWGは出力を維持する                     */
    /* ->正しくOFFしたいなら、ポートのステートを見るか、クロックを最後に停止  */
    /*==================================================================*/
    
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : AS5E    */   /* Auto-shutdown 無効 */
                            /*  | | | +------------------- 4 : AS4E    */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : AS3E    */
                            /*  | | | |     | +----------- 2 : AS2E    */
                            /*  | | | |     | | +--------- 1 : AS1E    */
                            /*  | | | |     | | | + ------ 0 : AS0E    */
    CWG1AS1 = 0x00U;        /*  # # 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* シャットダウンは特に利用しない                                     */
    /* 過電流判定を回路でしてCWG1PPSへの入力で強制オフするのはありかも。    */
    /*=================================================================*/
    
    /* CWG波形 立ち上がり時のデッドタイム 遅延設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : DBR<5>  */
                            /*  | | | +------------------- 4 : DBR<4>  */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : DBR<3>  */
                            /*  | | | |     | +----------- 2 : DBR<2>  */
                            /*  | | | |     | | +--------- 1 : DBR<1>  */
                            /*  | | | |     | | | + ------ 0 : DBR<0>  */
    CWG1DBR = 0x00U;        /*  # # 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* デッドタイム設定 何クロックにするか・・・                           */
    /* とりあえず適当なゲート抵抗で実測合わせで行く                        */
    /*=================================================================*/
    
    /* CWG波形 立ち下がり時のデッドタイム 遅延設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : DBF<5>  */
                            /*  | | | +------------------- 4 : DBF<4>  */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : DBF<3>  */
                            /*  | | | |     | +----------- 2 : DBF<2>  */
                            /*  | | | |     | | +--------- 1 : DBF<1>  */
                            /*  | | | |     | | | + ------ 0 : DBF<0>  */
    CWG1DBF = 0x00U;        /*  # # 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* デッドタイム設定 何クロックにするか・・・                           */
    /* とりあえず適当なゲート抵抗で実測合わせで行く                        */
    /*=================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  WDT設定                                                    */
/*                                                            */
/**************************************************************/
static void func_mset_s_watchdog_setup( void )
{
    /* WDTはひとまず無効 */
    WDTCON0 = 0x00;
    WDTCON1 = 0x00;
    WDTPSL = 0x00;
    WDTPSH = 0x00;
    WDTTMR = 0x00;
}

/* テンプレート */
/*=========================================================*/

                        /*  +------------------------- 7 : */
                        /*  | +----------------------- 6 : */
                        /*  | | +--------------------- 5 : */
                        /*  | | | +------------------- 4 : */
                        /*  | | | |                        */
                        /*  | | | |     +------------- 3 : */
                        /*  | | | |     | +----------- 2 : */
                        /*  | | | |     | | +--------- 1 : */
                        /*  | | | |     | | | + ------ 0 : */
    /*  0 0 0 0  -  0 0 1 1            */
/*-----------------------------------------------------------------*/
/* memo                                                            */
/*                                                                 */
/*=================================================================*/


